//***************************************
// B_LUX30_V30采集程序
//****************************************

#include "B_LUX_V30.h"

uint8    m_BUF[129];                       //接收数据缓存区      	
uint32   m_lightlux;                       //变量


/*---------------------------------------------------------------------
 功能描述: 延时纳秒 不同的工作环境,需要调整此函数
 参数说明: 无	
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_delay_nms(uint16 k)	
{						
  uint16 i,j;				
  for(i=0;i<k;i++)
  {			
    for(j=0;j<6000;j++)			
    {
      ;
    }
  }						
}					

/*---------------------------------------------------------------------
 功能描述: 延时5微秒  不同的工作环境,需要调整此函数
 参数说明: 无	
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_Delay5us()
{
  uint16 n = 50;
  
  while (n--);
}

/*---------------------------------------------------------------------
 功能描述: 延时5毫秒  不同的工作环境,需要调整此函数
 参数说明: 无	
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_Delay5ms()
{
  uint16 n = 50000;
  
  while (n--);
}

/*---------------------------------------------------------------------
 功能描述: 起始信号
 参数说明: 无	
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_Start()
{
  B_LUX30_SDA0_H;                         //拉高数据线
  B_LUX30_SCL0_H;                         //拉高时钟线
  B_LUX30_Delay5us();                     //延时
  B_LUX30_SDA0_L;                         //产生下降沿
  B_LUX30_Delay5us();                     //延时
  B_LUX30_SCL0_L;                         //拉低时钟线
}

/*---------------------------------------------------------------------
 功能描述: 停止信号
 参数说明: 无	
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_Stop()
{
  B_LUX30_SDA0_L;                         //拉低数据线
  B_LUX30_SCL0_H;                         //拉高时钟线
  B_LUX30_Delay5us();                     //延时
  B_LUX30_SDA0_H;                         //产生上升沿
  B_LUX30_Delay5us();                     //延时
  B_LUX30_SCL0_L;
  B_LUX30_Delay5us();
  
  B_LUX30_delay_nms(1000);                         //延时180ms
}

/*---------------------------------------------------------------------
 功能描述: 发送应答信号
 参数说明: ack - 应答信号(0:ACK 1:NAK)
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_SendACK(uint8 ack)
{
  if (ack&0x01)	B_LUX30_SDA0_H;		//写应答信号
  else	B_LUX30_SDA0_L;
  
  B_LUX30_SCL0_H;                         //拉高时钟线
  B_LUX30_Delay5us();                     //延时
  B_LUX30_SCL0_L;                         //拉低时钟线
  B_LUX30_SDA0_H;
  B_LUX30_Delay5us();                     //延时
}

/*---------------------------------------------------------------------
 功能描述: 接收应答信号
 参数说明: 无
 函数返回: 返回应答信号
 ---------------------------------------------------------------------*/
uint8 B_LUX30_RecvACK()
{
  uint8 CY = 0x00;
  B_LUX30_SDA0_H;
  
  B_LUX30_SDA0_I;
  
  B_LUX30_SCL0_H;                         //拉高时钟线
  B_LUX30_Delay5us();                     //延时
  
  
  CY |= B_LUX30_SDA0_DAT;                 //读应答信号
  
  B_LUX30_Delay5us();                     //延时
  
  B_LUX30_SCL0_L;                         //拉低时钟线
  
  B_LUX30_SDA0_O;
  
  return CY;
}

/*---------------------------------------------------------------------
 功能描述: 向IIC总线发送一个字节数据
 参数说明: dat - 写字节
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_SendByte(uint8 dat)
{
  uint8 i;
  
  for (i=0; i<8; i++)         			//8位计数器
  {
    if (dat&0x80)	B_LUX30_SDA0_H;
    else	B_LUX30_SDA0_L;                   //送数据口
    
    B_LUX30_Delay5us();             		//延时
    B_LUX30_SCL0_H;                		//拉高时钟线
    B_LUX30_Delay5us();             		//延时
    B_LUX30_SCL0_L;                		//拉低时钟线
    B_LUX30_Delay5us();             		//延时
    dat <<= 1;              			//移出数据的最高位
  }
  
  B_LUX30_RecvACK();
}

/*---------------------------------------------------------------------
 功能描述: 从IIC总线接收一个字节数据
 参数说明: 无
 函数返回: 接收字节
 ---------------------------------------------------------------------*/
uint8 B_LUX30_RecvByte()
{
  uint8 i;
  uint8 dat = 0;
  B_LUX30_SDA0_I;
  
  B_LUX30_SDA0_H;                         //使能内部上拉,准备读取数据,
  for (i=0; i<8; i++)         	        //8位计数器
  {
    dat <<= 1;
    B_LUX30_SCL0_H;                       //拉高时钟线
    B_LUX30_Delay5us();             	//延时
    dat |= B_LUX30_SDA0_DAT;              //读数据               
    B_LUX30_SCL0_L;                       //拉低时钟线
    B_LUX30_Delay5us();             	//延时
    
	
  }
  B_LUX30_SDA0_O;
  
  return dat;
}

/*---------------------------------------------------------------------
 功能描述: 写B_LUX30
 参数说明: REG_Address - 寄存器地址
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_Multiple_Write(uint8 REG_Address, uint8* vBuf, uint8 vLen)
{
  uint8 i = 0;
   //---------------------------写程序
  B_LUX30_Start();                                  //起始信号
  B_LUX30_SendByte(B_LUX30_SlaveAddress+0);         //发送设备地址+读信号
  B_LUX30_SendByte(REG_Address);                    //写地址
  for (i=0; i<=vLen; i++)                           //循环写数据
  {
    B_LUX30_SendByte(vBuf[i]);                      //写数据
  }
  B_LUX30_Stop();                                   //停止信号
  //---------------------------
  
}

/*---------------------------------------------------------------------
 功能描述: 读B_LUX30
 参数说明: REG_Address - 寄存器地址
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_Multiple_read(uint8 REG_Address, uint8* vBuf, uint8 vLen)
{
  uint8 i = 0;
  //---------------------------读程序
  B_LUX30_Start();                                //起始信号
  B_LUX30_SendByte(B_LUX30_SlaveAddress+0);       //发送设备地址+读信号
  B_LUX30_SendByte(REG_Address);                  //从0x00地址开始读取光照值
 
  B_LUX30_Start();                                //起始信号
  B_LUX30_SendByte(B_LUX30_SlaveAddress+1);       //发送设备地址+读信号
  B_LUX30_delay_nms(1);                           //延时180ms
  for (i=0; i<=vLen; i++)                            //连续读取4个地址数据，存储中BUF
  {
    vBuf[i] = B_LUX30_RecvByte();                //BUF[0]存储0x32地址中的数据
    if (i == vLen)
    {
      
      B_LUX30_SendACK(1);                         //最后一个数据需要回NOACK
    }
    else
    {		
      B_LUX30_SendACK(0);                         //回应ACK
    }
  }
  B_LUX30_Stop();                                 //停止信号
  
  //---------------------------
}

/*---------------------------------------------------------------------
 功能描述: 初始化光照传感器
 参数说明: 无
 函数返回: 无
 ---------------------------------------------------------------------*/
void B_LUX30_Init()
{
  P1SEL &= ~(0x0C);		//选择IO口
  
  B_LUX30_SCL0_O;
  B_LUX30_SDA0_O;
  
}

/*---------------------------------------------------------------------
 功能描述: 光照读取函数
 参数说明: 无
 函数返回: 返回光照值
 ---------------------------------------------------------------------*/
uint32 B_LUX30_GetLux()
{  
  uint32 val32 = 0;
  fint32 temp;
  uint8  i = 0;
  

  //---------------------------读程序
  B_LUX30_Start();                                //起始信号
  B_LUX30_SendByte(B_LUX30_SlaveAddress+0);       //发送设备地址+读信号
  B_LUX30_SendByte(0x00);                         //从0x00地址开始读取光照值
 
  B_LUX30_Start();                                //起始信号
  B_LUX30_SendByte(B_LUX30_SlaveAddress+1);       //发送设备地址+读信号
  B_LUX30_delay_nms(1);                           //延时180ms
  for (i=0; i<=3; i++)                            //连续读取4个地址数据，存储中BUF
  {
    m_BUF[i] = B_LUX30_RecvByte();                //BUF[0]存储0x32地址中的数据
    if (i == 3)
    {
      
      B_LUX30_SendACK(1);                         //最后一个数据需要回NOACK
    }
    else
    {		
      B_LUX30_SendACK(0);                         //回应ACK
    }
  }
  B_LUX30_Stop();                                 //停止信号
  
  //---------------------------
  
  val32   = m_BUF[3];
  val32 <<= 8;
  val32  |= m_BUF[2];
  val32 <<= 8;
  val32  |= m_BUF[1];
  val32 <<= 8;
  val32  |= m_BUF[0];
  
  temp = (fint32)val32*1.4;			   //半球透明度矫正值*1.4
  m_lightlux = (uint32)temp;
  return (uint32)temp;
} 

